{"graphnodedata":[{"id":"cf0b19f251f438","title":"The Mind-Body Problem","color":1,"content":"To determine whether machines can think under the assumption that humans are minded beings, one approach is to start with understanding what makes up the mind. That is the MBP: Is the mind (thinking, conscious, self) distinct or separate from the body (physical)?","time":1759096738588,"index":0,"x":-62.91494958294347,"y":-20.82575421703589,"vy":-0.000029641082473897516,"vx":-0.0003424912678101209,"fx":null,"fy":null},{"id":"1c0e0c501d58f8","title":"Substance Dualism","color":3,"content":"<div>Dualism is the theory that mental and physical are entirely distinct substances.&nbsp;</div><div>Founded by Descartes, it asserts mental substance is immaterial and non-spacial while the body can be explained in mechanical terms. Animals, lacking this mental substance, are essentially mechanical automata.&nbsp;</div><div><br></div><div>Descartes also uses inconceivability to argue 1. The mind can exist without the body -&gt; mind and body must be distinct. 2. Meaningful manipulation of language by machines is impossible -&gt; AI is possible but will only behave without genuine cognition.</div><div><br></div><div>Descartes distinction between behavior and cognition is ingrained into rejections of dualism. Eg: \"psychology must be different from physiology\"</div>","time":1759096738588,"index":1,"x":-88.52056541952349,"y":4.762252452653912,"vy":-0.0000736298339930148,"vx":-0.0003413327980688428,"fx":null,"fy":null},{"id":"06c78ace7fdf48","title":"Computation as Cognition","color":1,"content":"<div>Hobbes argues that all reasoning and therefore thinking can be considered as computation.</div><div>[Note: Walmsley p11 was hard to summarize.]</div><div>By the 17th century, mechanical calculators were invented (by Pascal and Leibniz). Under the assumption a universal language where all truths can be reduced to a calculus exists, it was a matter of time to develop a machine that could process the universal language.</div><div><br></div><div>Mindware (software of the brain hardware) could be understood as computation.</div>","time":1759097394376,"index":2,"x":56.88366980289383,"y":150.37785699648452,"vy":-0.0008016890585582276,"vx":-0.000026404447492972463,"fx":null,"fy":null},{"id":"b765d3d3e6ef5","title":"Weak vs Strong AI","color":2,"content":"<div>Coined by John Searle, Weak AI is an imitation of intelligence by defining rules and deriving conclusions within such rules. Strong AI says that a computer with the right program can possess a mind.</div><div><br></div><div>Put differently, Weak vs Strong AI is a simulation vs instance of cognition.</div><div><br></div><div>Suprapsychological AI: Most AI is anthropocentric and based on the human mind. Similarity to humans however aren't a requirement for cognition.&nbsp;</div><div><br></div><div>(Walmsley, p17)</div>","time":1759099384071,"index":3,"x":71.55383176265279,"y":119.77831883752602,"vy":-0.0007851064626414681,"vx":-0.0001263935874380721,"fx":null,"fy":null},{"id":"e949cd535243","title":"The Frame Problem","color":2,"content":"<div>Given a realization that cause a human to change beliefs, humans are capable of keeping irrelevant beliefs intact. However, a weak AI with explicitly coded truths must check every belief in a vast pool, which cannot be done efficiently like humans.&nbsp;</div><div><br></div><div>(Walmsley, p19)</div>","time":1759099475658,"index":4,"x":92.5346122657387,"y":94.12684168416943,"vy":-0.0005788077037690765,"vx":0.00013065382456305854,"fx":null,"fy":null},{"id":"7d6ae13673a718","title":"Dualism and Strong AI","color":2,"content":"<div>The existence of Strong AI won't necessarily refute Dualism despite many of Descartes arguments being proven wrong. It may simply be the case a \"soul\" is not necessary for mentality but is sufficient.&nbsp;</div><div><br></div><div>Simply put:</div><div>1) Cognition could be implemented with just material substance</div><div>2) Human cognition is implemented with mental substance</div>","time":1759100329512,"index":5,"x":-102.71471641538635,"y":35.319018778406374,"vy":-0.000032518751452239324,"vx":-0.0003391324298157115,"fx":null,"fy":null},{"id":"ec1eaceb7dc0e","title":"Physicalism","color":3,"content":"<div>The theory that everything that exists is ultimately physical -&gt; Rejects dualism.</div><div><br></div>","time":1759100514360,"index":6,"x":-7.712718305711844,"y":-72.33669262874733,"vy":-0.000004409980493943034,"vx":-0.00021832596271262737,"fx":null,"fy":null},{"id":"c9046d5cb3b168","title":"Physicalism and Strong AI","color":2,"content":"<div>Strong AI (an instance of cognition in a purely physical implementation) vindicates the possibility of physicalism.</div><div><br></div><div>Additionally shows thought can be implemented in vastly different hardware (brains vs non-biological machines) which implies cognition has the property of \"multiple realisability\"</div><div><br></div><div><br></div>","time":1759100736357,"index":7,"x":17.71641050260549,"y":-50.305711257331055,"vy":0.00007282634488933942,"vx":-0.00029550547725435046,"fx":null,"fy":null},{"id":"481732e8cd63b","title":"Interactionism","color":2,"content":"<div>Against the criticism to Dualism that the separation of mental and material substance disallows the mind to control the body, Descartes conveniently proposes that the mind and body causally interact -&gt; Interactionism.</div><div><br></div><div>However, when asked how such interaction occurs, Descartes objected that the question was ill posed, argued humans are incapable of understanding the connection, then proposed the brain is the conduit for mind-body interaction.</div>","time":1759101467544,"index":8,"x":-121.56117887516821,"y":1.7480224893677496,"vy":-0.00008911504888298432,"vx":-0.00035792718982436246,"fx":null,"fy":null},{"id":"abb0f7e2e8dcd8","title":"Monism","color":3,"content":"The Theory that there is only one fundamental type of stuff in the world, and<br><div>both ‘minds’ and ‘bodies’ are versions of this stuff. -&gt; Opposite of Dualism</div><div><br></div><div>The dominant version of monism is Physicalism (see separate note)</div><div>However, other variations exist:</div><div>Idealism -&gt; Everything is mental and matter only exists in the mind.</div><div>&nbsp; - Berkeleyan Idealism -&gt; Only humans (and perhaps God) has minds</div><div>&nbsp; - Panpsychist Idealism -&gt; Everything has a mind</div><div>Neutral Monism -&gt; Everything is made of something in between mind and matter.</div>","time":1759101773804,"index":9,"x":-34.95650239667156,"y":-47.25500704109589,"vy":-0.000018511962256270697,"vx":-0.00029709253711914944,"fx":null,"fy":null},{"id":"d6e3ba35a9c968","title":"Behaviorism","color":3,"content":"<div>The theory that mental states are simply dispositions to behave in a particular way in a certain situation.&nbsp;</div><div><br></div><div>As Ryle argues, belief is not a action (one doesn't sit down, believe apples are tasty, and stop believing apples are tasty before standing up), and therefore, belief must be a property like fragility which applies even when unobserved and is a disposition under certain conditions. Believe apples are tasty -&gt; Will eat apples if given one.</div>","time":1759181830488,"index":10,"x":-29.311303155909,"y":-99.68638246373202,"vy":-0.000025571987585599856,"vx":-0.00020323931470191516,"fx":null,"fy":null},{"id":"6d15bb8ebf647","title":"Arguments Against Behaviorism","color":2,"content":"<div>&nbsp;1) If the belief that it will rain is interpreted as a disposition to, among other things, take an umbrella outside, it doesn't take into account whether they want to stay dry. Therefore, behavioral dispositions are dependent on other mental states. If mental states are truly equivalent to their behavior manifestation, they must not be dependent on mental states that are simply mental states.</div><div>2) Hilary Putnam's Super Spartans [Note: GU Class 3 Slides]</div><div>3) [Note: GU Another Slide explanation I didn't get]</div>","time":1759182098676,"index":11,"x":-46.059058917457754,"y":-129.49223075221838,"vy":-0.00006432084393683175,"vx":-0.0002362930130279721,"fx":null,"fy":null},{"id":"b0bccdcc106c7","title":"Identity Theory","color":3,"content":"<div>Identity Theory (or brain state theory) states every mental state is identical to a physical state of the brain. Eg. States like anger, pain, belief are equivalent to their mental activations in the brain.&nbsp;</div><div><br></div><div>Popularized for it's explorability with empirical science.&nbsp;</div><div>Eg.&nbsp;</div><div>Observer water correlates with the compound H2O -&gt; Water is H2O</div><div><br></div><div>Smart argues against dualism by saying it is unbelievable that physics explains everything except \"the occurrence of sensations\" (the mind) and by Occams razor, its more plausible the mind is also explained by physics. Physicalism is simpler than Dualism while explaining all phenomena.</div>","time":1759182685158,"index":12,"x":26.20235050138924,"y":-83.62895796255484,"vy":0.00007125269905637503,"vx":-0.00018122889702876864,"fx":null,"fy":null},{"id":"9a06074e0cf86","title":"Arguments Against Identity Theory","color":2,"content":"Incompatibility with Multiple Realisability: Since mental states are \"physical human brain neuron firings\", the existence of any alien creature with similar mental lives won't be considered as having mental states. In short, Identity Theory requires all implementations of mindedness to be identical which is unlikely.&nbsp;","time":1759183635211,"index":13,"x":58.12251075647233,"y":-97.31648834211721,"vy":0.00015872893727005274,"vx":-0.00008013772442208837,"fx":null,"fy":null},{"id":"4f675ee2c8e158","title":"Functionalism","color":3,"content":"<div>The theory that mental states are defined by what they do.</div><div>By this theory, mental states are representational.</div>","time":1759184182716,"index":14,"x":3.425648449277193,"y":-103.72602016995943,"vy":0.000002709517008620595,"vx":-0.00018425703411187878,"fx":null,"fy":null},{"id":"4f1983cf3c454","title":"Turing and Computation","color":2,"content":"<div>Turing invented a theoretical machine (The Turing Machine) that is capable of solving any well defined problem. The machine can perform any algorithmic process and as a result \"computable\" came to be defined as being able to run on a Turing Machine.</div><div><br></div><div>Turing’s thesis, which claims that if cognitive processes are algorithmically calculable, then they could be carried out by a Turing Machine.</div>","time":1759184775573,"index":15,"x":81.15267270910905,"y":173.38845460549172,"vy":0.00017783819998709631,"vx":-0.0009384320070848238,"fx":null,"fy":null},{"id":"6cef2629b48e28","title":"GOFAI","color":3,"content":"<div>GOFAI (Good Old Fashioned AI) is a term coined by Haugeland for the&nbsp;classical or symbolic approach to cognitive science.&nbsp;</div><div>Underlying this approach is the idea that any statement can be written in symbolic logic with symbols in place of semantics (parts that provide meaning). \"If it is raining, I will take an umbrella\" -&gt; let p = \"it is raining\", q = \"I will take an umbrella\". Then the statement can be written as p implies q.&nbsp;</div><div>In this form, any manipulations that the syntax of logic allow maintains the truth (and hence semantics) and after any processing, semantics can be substituted back in.</div><div>Under the assumption thinking is semantic processing, computers that can perform logic will also be capable of thinking.</div>","time":1759189697304,"index":16,"x":36.99492523320417,"y":178.54926826310293,"vy":-0.000978546818984706,"vx":-0.0003888626536293954,"fx":null,"fy":null},{"id":"8a65771aac9c8","title":"The Chinese Room Experiment","color":2,"content":"<div>A thought experiment proposed by John Searle where a non Chinese speaker in a room of instructions interacts with a native Chinese speaker though those rules. Although the room is indistinguishable from a native speaker, the person in the room has no understanding of Chinese.</div><div>GOFAI is the Chinese room, it may be able to have perfect instructions but can still lack any \"understanding. \"If thoughts are composed of symbols, where do the symbols get their meaning?\"</div><div><br></div><div>Searle also clarifies a few misconceptions about the experiment:</div><div>1. The experiment doesn't show machines can't think: Humans are machines, humans can think.</div><div>2. Similarly, humans are computers (we can compute). Computers can think.</div><div>3. Doesn't show only brains can think, simply that brains must be doing MORE than a mere shuffling of symbols</div>","time":1759509113324,"index":17,"x":11.704407495349923,"y":200.76012543811524,"vy":-0.00041560299839002863,"vx":-0.000014881034559427396,"fx":null,"fy":null},{"id":"070e1663a965","title":"Connectionism","color":3,"content":"<div>If GOFAI is a model of the mind and how it processes thoughts, connectionism is an approach to model the brain.</div><div>Connectionist models are built form a multi-layer network of neuron like units. Unlike GOFAI, these neural networks can \"learn\" by adjusting each neuron's influence on the next.&nbsp;</div><div>Unlike GOFAI, information is stored in a distributed representation across the network.</div><div>This leads to brain-like properties such as damage resistance and graceful degradation (can handle noisy data and works after parts of the network break).</div>","time":1759510001896,"index":18,"x":33.31275342413449,"y":127.97248559426602,"vy":0.00014380067201530226,"vx":-0.0009687943969456358,"fx":null,"fy":null},{"id":"0ec76a3071d4a","title":"Dynamical Systems Theory","color":"0","content":"<div>The study of systems that change over time. (Variables are continuous?)</div><div><br></div><div>A state space is a space where features of the system is represented by a dimension in the space. Each vector in the space represents a state the system could be in.</div><div>Plotting the change of states in the state space creates trajectories.&nbsp;</div><div>Attractors in state space are where states tend to converge towards.</div><div>Feedback loops.</div><div><br></div><div>GOFAI and connectionist functionalism involve processing in discrete steps unlike DST where time is continuous.</div><div>DST sees cognition as a direct real-time interaction between an agent and it's environment. (states emerge dynamically from ongoing relationship between environment, body, and mind)&nbsp;</div><div><br></div>","time":1759931027982,"index":19,"x":89.66279076524333,"y":147.03527962486257,"vy":0.00007593145883066643,"vx":0.00010551366293440303,"fx":null,"fy":null}],"graphlinkdata":[{"source":"cf0b19f251f438","target":"1c0e0c501d58f8","strength":1},{"source":"06c78ace7fdf48","target":"b765d3d3e6ef5","strength":1},{"source":"b765d3d3e6ef5","target":"e949cd535243","strength":1},{"source":"1c0e0c501d58f8","target":"7d6ae13673a718","strength":1},{"source":"7d6ae13673a718","target":"b765d3d3e6ef5","strength":0},{"source":"ec1eaceb7dc0e","target":"c9046d5cb3b168","strength":1},{"source":"c9046d5cb3b168","target":"b765d3d3e6ef5","strength":0},{"source":"1c0e0c501d58f8","target":"481732e8cd63b","strength":1},{"source":"cf0b19f251f438","target":"abb0f7e2e8dcd8","strength":1},{"source":"abb0f7e2e8dcd8","target":"ec1eaceb7dc0e","strength":1},{"source":"ec1eaceb7dc0e","target":"d6e3ba35a9c968","strength":1},{"source":"d6e3ba35a9c968","target":"6d15bb8ebf647","strength":1},{"source":"ec1eaceb7dc0e","target":"b0bccdcc106c7","strength":1},{"source":"b0bccdcc106c7","target":"9a06074e0cf86","strength":1},{"source":"ec1eaceb7dc0e","target":"4f675ee2c8e158","strength":1},{"source":"06c78ace7fdf48","target":"4f1983cf3c454","strength":1},{"source":"06c78ace7fdf48","target":"6cef2629b48e28","strength":1},{"source":"6cef2629b48e28","target":"8a65771aac9c8","strength":1},{"source":"06c78ace7fdf48","target":"070e1663a965","strength":1},{"source":"06c78ace7fdf48","target":"0ec76a3071d4a","strength":1}]}